# Homebrew Bundle
# Install with: brew bundle install

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "ngrok/ngrok"

# =============================================================================
# CLI Tools
# =============================================================================

# Core utilities
brew "bat"                    # Better cat with syntax highlighting
brew "eza"                    # Modern ls replacement
brew "fzf"                    # Fuzzy finder
brew "ripgrep"                # Fast grep alternative
brew "tree"                   # Directory tree view
brew "trash"                  # Move to trash instead of rm

# Git & GitHub
brew "git"
brew "git-delta"              # Better git diff
brew "gh"                     # GitHub CLI
brew "hub"                    # GitHub wrapper for git

# Development
brew "ast-grep"               # Structural code search
brew "fnm"                    # Fast Node Manager
brew "go"
brew "starship"               # Cross-shell prompt

# Media
brew "ffmpeg"
brew "imagemagick"            # Image manipulation

# Infrastructure
brew "caddy"                  # Web server
brew "mkcert"                 # Local HTTPS certs
brew "nss"                    # Required by mkcert for Firefox
brew "rclone"                 # Cloud storage CLI

# Database
brew "postgresql@16"

# Shell
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# =============================================================================
# Applications (Casks)
# =============================================================================

# Browsers & Communication
cask "discord"
cask "slack"
cask "notion"

# Development
cask "cursor"                 # AI-powered editor
cask "visual-studio-code"
cask "ghostty"                # GPU-accelerated terminal
cask "iterm2"
cask "orbstack"               # Docker alternative

# Utilities
cask "bartender"              # Menu bar manager
cask "dropbox"
cask "ngrok"
cask "spotify"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-zed-mono-nerd-font"
