tap "ngrok/ngrok"
brew "jpeg-xl"
brew "aom"
brew "ast-grep"
brew "bat"
brew "biome"
brew "caddy"
brew "glib"
brew "cairo"
brew "eza"
brew "unbound"
brew "harfbuzz"
brew "icu4c@77"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "hub"
brew "mkcert"
brew "nss"
brew "postgresql@14"
brew "sherlock"
brew "tree"
brew "yt-dlp"
cask "1password-cli"
cask "brave-browser"
cask "discord"
cask "dropbox"
cask "google-chrome"
cask "ngrok"
cask "slack"
cask "spotify"
cask "todoist-app"
cask "visual-studio-code"
cask "zoom"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coderabbit.coderabbit-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "openai.chatgpt"
vscode "pnp.polacode"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shuding.next-ts-plugin-vscode"
vscode "sourcegraph.amp"
vscode "streetsidesoftware.code-spell-checker"
vscode "tobermory.es6-string-html"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "wakatime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
